app/views/entries/_entry.html.erb

  <div id="comments-<%= entry.id %>">
    <% entry.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."entry_id" = ?  ORDER BY "comments"."created_at" DESC  [["entry_id", 265]]