app/controllers/comments_controller.rb

  def create
    @comment = @entry.comments.build(comment_params) do |c|
      c.user = current_user
    end
    if @comment.save
---
INSERT INTO "comments" ("entry_id", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["entry_id", 300], ["content", "de"], ["user_id", 1], ["created_at", "2016-01-21 03:59:05.687403"], ["updated_at", "2016-01-21 03:59:05.687403"]]