app/controllers/entries_controller.rb

  def create
    @entry = current_user.entries.build(entry_params)
    @entry.save
    flash.now[:success] = "New entry is created."
    @entries = current_user.feed.paginate(page: params[:page])
---
INSERT INTO "entries" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Dan tri"], ["content", "De van mo"], ["user_id", 1], ["created_at", "2016-01-21 01:17:01.654809"], ["updated_at", "2016-01-21 01:17:01.654809"]]
SELECT COUNT(*) FROM "entries" WHERE "entries"."user_id" = ?  [["user_id", 1]]